Revit 2017 API
ProjectLocation.SiteLocation Property
The site location to which this project location refers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public SiteLocation SiteLocation { get; }
Visual Basic
Public ReadOnly Property SiteLocation As SiteLocation
	Get
Visual C++
public:
property SiteLocation^ SiteLocation {
	SiteLocation^ get ();
}
Remarks
The site location object contains the longitude, latitude and time-zone of the entire project site.
See Also
ProjectLocation Class
Autodesk.Revit.DB Namespace